FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_Timer.c
    // Check to see if there are any callbacks
    any = EFalse;
    for (i = 0; i < 4; i++) {
        if (p->iCallbacks[i].iCallbackFunc) {
            any = ETrue;
            break;
        }
    }

    // Register or deregister the interrupt
    if (any) {
        // Register if not already registered
        if (!InterruptIsRegistered(p->iInfo->iVector))
            InterruptRegister(p->iInfo->iVector, p->iInfo->iISR,
                INTERRUPT_PRIORITY_HIGH, p->iInfo->iName);
        InterruptEnable(p->iInfo->iVector);
    } else {
        // No one registered anymore, turn off this callback (but leave registered)
        InterruptDisable(p->iInfo->iVector);
    }
    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_Timer_SetMatchRegisterFunctions
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup one of several timer's match registers and what to do on
 *      a match.
 * Inputs:
 *      void *aWorkspace        -- Timer's workspace
 *      TUInt8 aMatchRegister   -- Index to match register (0-3)
 *      T_Timer_MatchPointFunction aFunctions -- List of functions to perform
 *          when the timer reaches this match point.
 *      TUInt32 aMatchPoint -- Point at which functions trigger
 * Outputs:
 *      T_uezError -- Returns UEZ_ERROR_ILLEGAL_PARAMETER if match register
 *          does not exist.  Returns UEZ_ERROR_ILLEGAL_OPERATION if a
 *          function in aFunctions is not supported.  Otherwise, returns
 *          UEZ_ERROR_NONE.
 *---------------------------------------------------------------------------*/
static T_uezError LPC2478_Timer_SetMatchRegisterFunctions(
    void *aWorkspace,
    TUInt8 aMatchRegister,
    T_Timer_MatchPointFunction aFunctions,
    TUInt32 aMatchPoint)
{
    T_LPC2478_Timer_Workspace *p = (T_LPC2478_Timer_Workspace *)aWorkspace;
    T_LPC2478_Timer_Registers *r = p->iReg;
    TUInt32 aFlags = 0;
    const T_LPC2478_Timer_Info *p_info = p->iInfo;

    // Determine if legal match register
    if (aMatchRegister >= 4)
        return UEZ_ERROR_ILLEGAL_PARAMETER;

    //Make sure Power to the Timer is turned on
    PCONP |= (1<<p_info->iPCONBitIndex);

    // Make sure the PCLK divider for this timer is a CCLK/1
    *(p_info->iPCLKSELReg) = ((*(p_info->iPCLKSELReg)) & ~(3
        << p_info->iPCLKSELBitIndex)) | (1 << p_info->iPCLKSELBitIndex);

    if (aFunctions & ~(TIMER_MATCH_POINT_FUNC_INTERRUPT
        | TIMER_MATCH_POINT_FUNC_RESET | TIMER_MATCH_POINT_FUNC_STOP))
        return UEZ_ERROR_ILLEGAL_OPERATION;

    // Determine what the combined flags are
    if (aFunctions & TIMER_MATCH_POINT_FUNC_INTERRUPT)
        aFlags |= (1 << 0);
    if (aFunctions & TIMER_MATCH_POINT_FUNC_RESET)
        aFlags |= (1 << 1);
    if (aFunctions & TIMER_MATCH_POINT_FUNC_STOP)
        aFlags |= (1 << 2);

    // Set the actions on the match
    r->iMCR &= ~(7 << (aMatchRegister * 3));
    r->iMCR |= (aFlags << (aMatchRegister * 3));

    // Change the match register
    r->iMR[aMatchRegister] = aMatchPoint;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  IClear
 *---------------------------------------------------------------------------*
 * Description:
 *      Clear all the callback information for this workspace
 * Inputs:
 *      T_LPC2478_Timer_Workspace *p  -- Particular Timer workspace
 *---------------------------------------------------------------------------*/
static void IClear(T_LPC2478_Timer_InterruptCallback aCallbacks[4])
{
    TUInt8 i;
    for (i = 0; i < 4; i++) {
        aCallbacks[i].iCallbackFunc = 0;
        aCallbacks[i].iCallbackWorkspace = 0;
    }
}
/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_Timer0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC2478 Timer0 workspace.
 * Inputs:
 *      void *aW                    -- Particular Timer workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_Timer0_InitializeWorkspace(void *aWorkspace)
{
    T_LPC2478_Timer_Workspace *p = (T_LPC2478_Timer_Workspace *)aWorkspace;
    p->iReg = (T_LPC2478_Timer_Registers *)TIMER0_BASE;
    p->iInfo = &G_Timer0_Info;
    IClear(p->iCallbacks);

    G_Timer0_Workspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_Timer1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC2478 Timer1 workspace.
 * Inputs:
 *      void *aW                    -- Particular Timer workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_Timer1_InitializeWorkspace(void *aWorkspace)
{
    T_LPC2478_Timer_Workspace *p = (T_LPC2478_Timer_Workspace *)aWorkspace;
    p->iReg = (T_LPC2478_Timer_Registers *)TIMER1_BASE;
    p->iInfo = &G_Timer1_Info;
    IClear(p->iCallbacks);

    G_Timer1_Workspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_Timer2_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC2478 Timer1 workspace.
 * Inputs:
 *      void *aW                    -- Particular Timer workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_Timer2_InitializeWorkspace(void *aWorkspace)
{
    T_LPC2478_Timer_Workspace *p = (T_LPC2478_Timer_Workspace *)aWorkspace;
    p->iReg = (T_LPC2478_Timer_Registers *)TIMER2_BASE;
    p->iInfo = &G_Timer2_Info;
    IClear(p->iCallbacks);

    G_Timer2_Workspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  LPC2478_Timer3_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the LPC2478 Timer1 workspace.
 * Inputs:
 *      void *aW                    -- Particular Timer workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError LPC2478_Timer3_InitializeWorkspace(void *aWorkspace)
{
    T_LPC2478_Timer_Workspace *p = (T_LPC2478_Timer_Workspace *)aWorkspace;
    p->iReg = (T_LPC2478_Timer_Registers *)TIMER3_BASE;
    p->iInfo = &G_Timer3_Info;
    IClear(p->iCallbacks);

