FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC2478/LPC2478_Timer.c
    G_Timer3_Workspace = p;

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Internal Information tables:
 *---------------------------------------------------------------------------*/
static const T_LPC2478_Timer_Info G_Timer0_Info = {
    INTERRUPT_CHANNEL_TIMER0,
    (TISRFPtr)Timer0_ISR,
    "Timer0",
    &PCLKSEL0,
    2,
    PCONP_PCTIM0_BIT,};

static const T_LPC2478_Timer_Info G_Timer1_Info = {
    INTERRUPT_CHANNEL_TIMER1,
    (TISRFPtr)Timer1_ISR,
    "Timer1",
    &PCLKSEL0,
    4,
    PCONP_PCTIM1_BIT, };

static const T_LPC2478_Timer_Info G_Timer2_Info = {
    INTERRUPT_CHANNEL_TIMER2,
    (TISRFPtr)Timer2_ISR,
    "Timer2",
    &PCLKSEL1,
    12,
    PCONP_PCTIM2_BIT,};

static const T_LPC2478_Timer_Info G_Timer3_Info = {
    INTERRUPT_CHANNEL_TIMER3,
    (TISRFPtr)Timer3_ISR,
    "Timer3",
    &PCLKSEL1,
    14,
    PCONP_PCTIM3_BIT,};

/*---------------------------------------------------------------------------*
 * Requirement routines:
 *---------------------------------------------------------------------------*/
void LPC2478_Timer0_Require(const T_LPC2478_Timer_Settings *aSettings)
{
    static const T_LPC2478_PINSEL_ConfigList pinsCAP0[] = { // CAP0[0]
            {GPIO_P1_26, 3},
            {GPIO_P3_23, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsCAP1[] = { // CAP0[1]
            {GPIO_P1_27, 3},
            {GPIO_P3_24, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMAT0[] = { // MAT0[0]
            {GPIO_P1_28, 3},
            {GPIO_P3_25, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMAT1[] = { // MAT1[0]
            {GPIO_P1_29, 3},
            {GPIO_P3_26, 2},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer0
    HALInterfaceRegister("Timer0", (T_halInterface *)&LPC2478_Timer0_Interface,
            0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iCAP[0], pinsCAP0,
            ARRAY_COUNT(pinsCAP0));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iCAP[1], pinsCAP1,
            ARRAY_COUNT(pinsCAP1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[0], pinsMAT0,
            ARRAY_COUNT(pinsMAT0));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[1], pinsMAT1,
            ARRAY_COUNT(pinsMAT1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[2], 0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[3], 0, 0);
}

void LPC2478_Timer1_Require(const T_LPC2478_Timer_Settings *aSettings)
{
    static const T_LPC2478_PINSEL_ConfigList pinsCAP0[] = { // CAP1[0]
            {GPIO_P1_18, 3},
            {GPIO_P3_27, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsCAP1[] = { // CAP1[1]
            {GPIO_P1_19, 3},
            {GPIO_P3_28, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMAT0[] = { // MAT1[0]
            {GPIO_P1_22, 3},
            {GPIO_P3_29, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMAT1[] = { // MAT1[1]
            {GPIO_P1_25, 3},
            {GPIO_P3_30, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMAT2[] = { // MAT1[2]
            {GPIO_P3_31, 2},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer1
    HALInterfaceRegister("Timer1", (T_halInterface *)&LPC2478_Timer1_Interface,
            0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iCAP[0], pinsCAP0,
            ARRAY_COUNT(pinsCAP0));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iCAP[1], pinsCAP1,
            ARRAY_COUNT(pinsCAP1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[0], pinsMAT0,
            ARRAY_COUNT(pinsMAT0));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[1], pinsMAT1,
            ARRAY_COUNT(pinsMAT1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[2], pinsMAT2,
            ARRAY_COUNT(pinsMAT2));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[3], 0, 0);
}

void LPC2478_Timer2_Require(const T_LPC2478_Timer_Settings *aSettings)
{
    static const T_LPC2478_PINSEL_ConfigList pinsCAP0[] = { // CAP2[0]
            {GPIO_P0_4,  3},
            {GPIO_P2_14, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsCAP1[] = { // CAP2[1]
            {GPIO_P0_5,  3},
            {GPIO_P2_15, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMAT0[] = { // MAT2[0]
            {GPIO_P0_6,  3},
            {GPIO_P4_28, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMAT1[] = { // MAT2[1]
            {GPIO_P0_7,  3},
            {GPIO_P4_29, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMAT2[] = { // MAT2[2]
            {GPIO_P0_8,  3},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMAT3[] = { // MAT2[3]
            {GPIO_P0_9,  3},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer2
    HALInterfaceRegister("Timer2", (T_halInterface *)&LPC2478_Timer2_Interface,
            0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iCAP[0], pinsCAP0,
            ARRAY_COUNT(pinsCAP0));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iCAP[1], pinsCAP1,
            ARRAY_COUNT(pinsCAP1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[0], pinsMAT0,
            ARRAY_COUNT(pinsMAT0));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[1], pinsMAT1,
            ARRAY_COUNT(pinsMAT1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[2], pinsMAT2,
            ARRAY_COUNT(pinsMAT2));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[2], pinsMAT3,
            ARRAY_COUNT(pinsMAT3));
}

void LPC2478_Timer3_Require(const T_LPC2478_Timer_Settings *aSettings)
{
    static const T_LPC2478_PINSEL_ConfigList pinsCAP0[] = { // CAP3[0]
            {GPIO_P2_22, 2},
            {GPIO_P0_23, 3},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsCAP1[] = { // CAP3[1]
            {GPIO_P2_23, 2},
            {GPIO_P0_24, 3},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMAT0[] = { // MAT3[0]
            {GPIO_P0_10, 3},
            {GPIO_P2_26, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMAT1[] = { // MAT3[1]
            {GPIO_P0_11, 3},
            {GPIO_P2_27, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMAT2[] = { // MAT3[2]
            {GPIO_P2_30, 2},
    };
    static const T_LPC2478_PINSEL_ConfigList pinsMAT3[] = { // MAT3[3]
            {GPIO_P2_31, 2},
    };
    HAL_DEVICE_REQUIRE_ONCE();
    // Register Timer3
    HALInterfaceRegister("Timer3", (T_halInterface *)&LPC2478_Timer3_Interface,
            0, 0);
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iCAP[0], pinsCAP0,
            ARRAY_COUNT(pinsCAP0));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iCAP[1], pinsCAP1,
            ARRAY_COUNT(pinsCAP1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[0], pinsMAT0,
            ARRAY_COUNT(pinsMAT0));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[1], pinsMAT1,
            ARRAY_COUNT(pinsMAT1));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[2], pinsMAT2,
            ARRAY_COUNT(pinsMAT2));
    LPC2478_PINSEL_ConfigPinOrNone(aSettings->iMAT[2], pinsMAT3,
            ARRAY_COUNT(pinsMAT3));
}
/*---------------------------------------------------------------------------*
 * HAL Interface table:
 *---------------------------------------------------------------------------*/
const HAL_Timer LPC2478_Timer0_Interface = {
    "NXP:LPC2478:Timer0",
    0x0100,
    LPC2478_Timer0_InitializeWorkspace,
    sizeof(T_LPC2478_Timer_Workspace),

    LPC2478_Timer_SetTimerMode,
    LPC2478_Timer_SetCaptureSource,
    LPC2478_Timer_SetMatchRegister,
    LPC2478_Timer_SetExternalControl,
    LPC2478_Timer_Reset,
    LPC2478_Timer_Enable,
    LPC2478_Timer_Disable,
    LPC2478_Timer_SetMatchCallback,
    LPC2478_Timer_SetMatchRegisterFunctions, };

const HAL_Timer LPC2478_Timer1_Interface = {
    "NXP:LPC2478:Timer1",
    0x0100,
    LPC2478_Timer1_InitializeWorkspace,
    sizeof(T_LPC2478_Timer_Workspace),

    LPC2478_Timer_SetTimerMode,
    LPC2478_Timer_SetCaptureSource,
    LPC2478_Timer_SetMatchRegister,
    LPC2478_Timer_SetExternalControl,
    LPC2478_Timer_Reset,
    LPC2478_Timer_Enable,
    LPC2478_Timer_Disable,
    LPC2478_Timer_SetMatchCallback,
    LPC2478_Timer_SetMatchRegisterFunctions, };

const HAL_Timer LPC2478_Timer2_Interface = {
    "NXP:LPC2478:Timer2",
    0x0100,
    LPC2478_Timer2_InitializeWorkspace,
    sizeof(T_LPC2478_Timer_Workspace),

    LPC2478_Timer_SetTimerMode,
    LPC2478_Timer_SetCaptureSource,
    LPC2478_Timer_SetMatchRegister,
    LPC2478_Timer_SetExternalControl,
    LPC2478_Timer_Reset,
    LPC2478_Timer_Enable,
    LPC2478_Timer_Disable,
    LPC2478_Timer_SetMatchCallback,
    LPC2478_Timer_SetMatchRegisterFunctions, };

const HAL_Timer LPC2478_Timer3_Interface = {
    "NXP:LPC2478:Timer3",
    0x0100,
    LPC2478_Timer3_InitializeWorkspace,
    sizeof(T_LPC2478_Timer_Workspace),

    LPC2478_Timer_SetTimerMode,
    LPC2478_Timer_SetCaptureSource,
    LPC2478_Timer_SetMatchRegister,
    LPC2478_Timer_SetExternalControl,
    LPC2478_Timer_Reset,
    LPC2478_Timer_Enable,
    LPC2478_Timer_Disable,
    LPC2478_Timer_SetMatchCallback,
    LPC2478_Timer_SetMatchRegisterFunctions, };

/*-------------------------------------------------------------------------*
 * End of File:  Timer.c
 *-------------------------------------------------------------------------*/

